Core/src/src/Enums/РС_ВидыРежимовПротокола/РС_ВидыРежимовПротокола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ВидыРежимовПротокола</name>
  <enumValues>
    <name>http</name>
  </enumValues>
  <enumValues>
    <name>https</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/CommonModules/РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп/Module.bsl
Функция ПолучитьSLLСоединение() Экспорт 
	
	SLL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(),Новый СертификатыУдостоверяющихЦентровWindows());
	
	Возврат SLL;
	
КонецФункции

Функция ПолучитьWSОпределение(РежимПротокола = Неопределено) Экспорт 
	
	SLL = ПолучитьSLLСоединение();
	
	#Если Сервер Тогда
		Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
			Возврат Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
		Иначе 
			Возврат Новый WSОпределения("https://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "",,,,SLL);
		КонецЕсли;
	#Иначе
		Если глОпределение = Неопределено Тогда
			Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
				глОпределение = Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
			Иначе 
				глОпределение = Новый WSОпределения("https://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "",,,,SLL);
			КонецЕсли;
		КонецЕсли;
		Возврат	глОпределение;
	#КонецЕсли
	
КонецФункции

Функция ПолучитьWSОпределениеСФ(РежимПротокола = Неопределено) Экспорт 
	
	SLL = ПолучитьSLLСоединение();
	
	#Если Сервер Тогда
		Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
			Возврат Новый WSОпределения("http://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "");
		Иначе 
			Возврат Новый WSОпределения("https://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "",,,,SLL);
		КонецЕсли;
	#Иначе
		Если глОпределение = Неопределено Тогда
			Если РежимПротокола = Перечисления.РС_ВидыРежимовПротокола.http Тогда 
				глОпределение = Новый WSОпределения("http://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "");
			Иначе 
				глОпределение = Новый WSОпределения("https://www.revenue.mof.ge/ntosservice/ntosservice.asmx?wsdl", "",,,,SLL);
			КонецЕсли;
		КонецЕсли;
		Возврат	глОпределение;
	#КонецЕсли
	
КонецФункции

Функция ПолучитьСтруктуруПараметровWS(Организация = Неопределено) Экспорт
	
	СтруктураИнициализации = Новый Структура;
	СтруктураИнициализации.Вставить("ПользовательПодключения","");
	СтруктураИнициализации.Вставить("ПарольПодключения","");
	СтруктураИнициализации.Вставить("РежимовПротоколаДляОбменаRS","");
	
	Если Организация = Неопределено Тогда 
		Организация = РегламентированнаяОтчетность.ПолучитьОрганизациюПоУмолчанию();//РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп
	КонецЕсли;
	
	Если Организация.МногопользовательскийРежимОбменаRS Тогда 
		//Отбор = Новый Структура;
		//Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьНесколькоОрганизаций") Тогда
		//	Отбор.Вставить("Организация", Организация);
		//КонецЕсли;
		//Отбор.Вставить("Пользователь", Пользователи.ТекущийПользователь());
		//ВыборкаТекПараметрыПользователья = РегистрыСведений.РС_ПользователиИнтеграцийНалоговойСлужбы.Выбрать(Отбор);
		
		//++Lazare_ закомментировал 25.08.2021. Когда количество параметров >1,выборка не работает.Структура Отборa может содержать только один элемент !	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_ПользователиИнтеграцийНалоговойСлужбы.ПользовательПодключения КАК ПользовательПодключения,
		|	РС_ПользователиИнтеграцийНалоговойСлужбы.ПарольПодключения КАК ПарольПодключения,
		|	РС_ПользователиИнтеграцийНалоговойСлужбы.РежимовПротоколаДляОбменаRS КАК РежимовПротоколаДляОбменаRS
		|ИЗ
		|	РегистрСведений.РС_ПользователиИнтеграцийНалоговойСлужбы КАК РС_ПользователиИнтеграцийНалоговойСлужбы
		|ГДЕ
		|	РС_ПользователиИнтеграцийНалоговойСлужбы.Пользователь = &Пользователь
		|	И РС_ПользователиИнтеграцийНалоговойСлужбы.Организация = &Организация";
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьНесколькоОрганизаций") Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РС_ПользователиИнтеграцийНалоговойСлужбы.Организация = &Организация", "");
		КонецЕсли;
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		//--Lazare_25.08.2021
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаТекПараметрыПользователья = РезультатЗапроса.Выбрать();	
		
		Если ВыборкаТекПараметрыПользователья.Следующий() Тогда  
			СтруктураИнициализации.ПользовательПодключения		= ВыборкаТекПараметрыПользователья.ПользовательПодключения;
			СтруктураИнициализации.ПарольПодключения			= ВыборкаТекПараметрыПользователья.ПарольПодключения;
			СтруктураИнициализации.РежимовПротоколаДляОбменаRS  = ?(ЗначениеЗаполнено(Организация.РежимовПротоколаДляОбменаRS), Организация.РежимовПротоколаДляОбменаRS, Перечисления.РС_ВидыРежимовПротокола.http);
		Иначе 
			Сообщить(НСтр("ka='არ არის ნაპოვნი სერვისის მომხმარებელი პროგრამის მიმდინარე მომხმარებლისთვის.';ru='Не найдены настройки сервиса для текущего пользователя.';en='service settings are not found for the current user.'"));
		КонецЕсли;
	Иначе 
		СтруктураИнициализации.ПользовательПодключения		= Организация.ПользовательПодключения;
		СтруктураИнициализации.ПарольПодключения			= Организация.ПарольПодключения;
		СтруктураИнициализации.РежимовПротоколаДляОбменаRS  = ?(ЗначениеЗаполнено(Организация.РежимовПротоколаДляОбменаRS), Организация.РежимовПротоколаДляОбменаRS, Перечисления.РС_ВидыРежимовПротокола.http);
	КонецЕсли;
	Возврат СтруктураИнициализации;
	
КонецФункции

Функция ПодсистемаДоступна_ИнтеграцияСНалоговойСлужбойГрузии() Экспорт
	
	Возврат (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("РаботаСМодулемИнтеграцииRSGE"));
	
КонецФункции
